artillery/test.yml
config:
  target: 'http://192.168.8.29:8010'
  phases:
    - duration: 30
      arrivalRate: 1
  payload:
    path: "data.csv"
    fields:
      - "start_lat"
      - "start_long"
      - "end_lat"
      - "end_long"
      - "rider_name"
      - "driver_name"
      - "driver_vehicle"
    delimiter: "|"
scenarios:
  - name: "Post Rides & Get"
    flow:
      - post:
          url: "/rides"
          json: 
            start_lat: "{{ start_lat }}"
            start_long: "{{ start_long }}"
            end_lat: "{{ end_lat }}"
            end_long: "{{ end_long }}"
            rider_name: "{{ rider_name }}"
            driver_name: "{{ driver_name }}"
            driver_vehicle: "{{ driver_vehicle }}"
          capture:
            json: "$.results[0].rideID"
            as: "id"
      - get:
          url: "/rides/{{ id }}"
  - name: "Post Rides & Get All"
    flow:
      - post:
          url: "/rides"
          json: 
            start_lat: "{{ start_lat }}"
            start_long: "{{ start_long }}"
            end_lat: "{{ end_lat }}"
            end_long: "{{ end_long }}"
            rider_name: "{{ rider_name }}"
            driver_name: "{{ driver_name }}"
            driver_vehicle: "{{ driver_vehicle }}"
      - get:
          url: "/rides"